Repository: zipf/perldoc-es
Catalog: tm/work/perlspanish-omegat.explorer.tmx
Source language: en_us
Languages: es_es

source: L An unsigned long value.
es_es: L Un valor de un largo sin signo.

source: =head2 Warning on \1 Instead of $1
es_es: =head2 Atención sobre \1 en lugar de $1

source: A new utility, C<prove>, makes it easy to run an individual regression test at the command line.
es_es: Una nueva utilidad, C<prove>, hace que sea fácil ejecutar una prueba de regresión individual en la línea de comandos.

source: print '-' x 80; # print row of dashes
es_es: print '-' x 80; # imprime una fila de guiones

source: F<ptardiff> is a small utility that produces a diff between an extracted archive and an unextracted one.
es_es: F<ptardiff> es una pequeña utilidad que genera las diferencias entre un archivo de almacenamiento extraído y uno sin extraer.

source: When used without a name the "skip point" is where the match point was when executing the (*SKIP) pattern.
es_es: Cuando es usado sin nombre, el "punto de salto" es donde estaba el punto de coincidencia cuando se ejecutaba el patrón (*SKIP).

source: (On other statements the loop modifiers test the conditional first.)
es_es: (En otras instrucciones los modificadores de bucle comprueban primero la condición).

source: sub myname;
es_es: sub minombre;

source: ISBN 1-930110-00-6 [1st edition 2001]
es_es: ISBN 1-930110-00-6 [1ª edición - 2001]

source: LISTs do automatic interpolation of sublists.
es_es: LISTAs hacen una interpolación automática de las sublistas.

source: Calls the System V IPC function semget(2).
es_es: Llama a la función System V IPC semget(2).

source: Using substr() on a UTF8 string could cause subsequent accesses on that string to return garbage.
es_es: Usando substr() en una cadena UTF8 podría causar que los subsecuentes accesos a dicha cadena devuelvan basura.

source: $hexdigit = ('a','b','c','d','e','f')[$digit-10];
es_es: $digitohex = ('a','b','c','d','e','f')[$digito-10];

source: Regarding precedence, the filetest operators, like C<-f>, C<-M>, etc. are treated like named unary operators, but they don't follow this functional parenthesis rule.
es_es: En cuanto a la precedencia, los operadores test de archivos, como C<-f>, C<-M>, etc, son tratados como operadores unarios con nombre, pero no siguen esta regla funcional de los paréntesis.

source: It can be understood as being roughly equivalent to:
es_es: Puede ser entendida como equivalente a:

source: %B like %b, but using an upper-case "B" with the # flag
es_es: %B como %b, pero usando una letra "B" mayúscula con la bandera #

source: Each ".." operator maintains its own boolean state, even across calls to a subroutine that contains it.
es_es: Cada operador ".." mantiene su estado booleano propio, incluso a través de llamadas a la subrutina que lo contenga.

source: =head2 PCRE/Python Support
es_es: =head2 Soporte PCRE/Python

source: A ponie.
es_es: Un poni.

source: =item format parameter index
es_es: =item índice de parámetro de formato

source: C<$(> and C<$)> now return groups in the order where the OS returns them, thanks to Gisle Aas.
es_es: C<$(> y C<$)> ahora devuelven grupos en el orden en que el SO los devuelve, gracias a Gisle Aas.

source: =head2 New "read() on %s filehandle %s"
es_es: =head2 Nuevo "I<read() on %s filehandle %s>" (read() en identificador %s de archivo %s)

source: open(STDOUT, ">&", $oldout) or die "Can't dup \$oldout: $!";
es_es: open(STDOUT, ">&", $oldout) or die "No puedo duplicar \$oldout: $!";

source: If EXPR is C<... && ...> or C<... and ...>, the test is applied recursively to both operands.
es_es: Si EXPR es C<... && ...> o C<... and ...>, el test se aplica recursivamente a ambos operandos.

source: You can also use C<while> in a post-condition:
es_es: También puede usar C<while> en una condición posterior:

source: The following escape sequences are available in constructs that interpolate, but not in transliterations.
es_es: Las siguientes secuencias de escape están disponibles en construcciones que interpolan, pero no en transliteraciones.

source: =item y/SEARCHLIST/REPLACEMENTLIST/cdsr
es_es: =item y/LISTA_BÚSQUEDA/LISTA_REEMPLAZO/cdsr

source: A test suite for the s2p converter.
es_es: Conjuntos de pruebas del conversor s2p.

source: See also L<perlipc/"SysV IPC">, C<IPC::SysV>, and C<IPC::SysV::Semaphore> documentation.
es_es: Vea también la documentación de L<perlipc/"SysV IPC">, C<IPC::SysV>, y C<IPC::Semaphore>.

source: =head1 HISTORY
es_es: =head1 HISTORIA

source: that ${^PREMATCH}, ${^MATCH}, ${^POSTMATCH} will be defined.
es_es: de tal manera que serán definidas ${^PREMATCH}, ${^MATCH} y ${^POSTMATCH}.

source: Any additional arguments are passed to the C<new> method of the class (meaning C<TIESCALAR>, C<TIEHANDLE>, C<TIEARRAY>, or C<TIEHASH>).
es_es: Cualesquiera argumentos adicionales son pasados al método C<new> de la clase (es decir, C<TIESCALAR>, C<TIEHANDLE>, C<TIEARRAY>, o C<TIEHASH>).

source: The C<\I<digit>> notation also works in certain circumstances outside the pattern.
es_es: La notación C<\I<dígito>> también funciona, en ciertas circunstancias, fuera del patrón.

source: Currently (in Perl 5.8.x) the stdio library is still used if Perl thinks it can use certain tricks to make stdio go B<really> fast.
es_es: En la actualidad (en Perl 5.8.x) la biblioteca stdio todavía es utilizada si Perl piensa que puede usar ciertos trucos para hacer que stdio vaya B<realmente> más rápido.

source: $file =~ s#^(\s)#./$1#;
es_es: $archivo =~ s#^(\s)#./$1#;

source: C<when> executes the statement I<when> C<$_> smart matches C<EXPR>, and then either C<break>s out if it's enclosed in a C<given> scope or skips to the C<next> element when it lies directly inside a C<for> loop.
es_es: C<when> ejecuta la instrucción I<cuando> C<$_> coincide inteligentemente con C<EXPR>, y después, o bien C<salta> fuera si está encerrada en un ámbito C<given> o salta al C<siguiente> elemento cuando reside dentro de un bucle C<for>.

source: Some operating and filesystems do not get this right, so Perl automatically removes all trailing slashes to keep everyone happy.
es_es: Algunos sistemas operativos y de sistemas de archivos no interpretan esto de forma correcta, por lo que Perl automáticamente elimina todas las barras inclinadas finales para tener a todo el mundo feliz.

source: s Treat string as single line.
es_es: s Trata la cadena como una única línea.

source: If the range operator is changed to C<...>, it will also print the "Baz" line.
es_es: Si el operador se cambia a C<...>, también se imprimirá la línea "Baz".

source: perl573delta has been added to list the differences between the (now quite obsolete) development releases 5.7.2 and 5.7.3.
es_es: perl573delta se ha añadido a la lista de las diferencias entre las versiones de desarrollo (ya bastante obsoletas) 5.7.2 y 5.7.3.

# print "Hello, world ";
source: print "Hello, world\n";
es_es: print "Hola a todos\n";

# may be closer to the conjectural I<intention> of the writer of C<"Q E">.
source: may be closer to the conjectural I<intention> of the writer of C<"\Q\t\E">.
es_es: puede conjeturar que puede estar muy cerca de la I<intención> de quien escribió C<"\Q\t\E">.

source: The search engine will initially match C<\D*> with "ABC".
es_es: El motor de búsqueda inicialmente coincidirá C<\D*> con "ABC".

source: # now process $line
es_es: # ahora, procesa $linea

source: Returns I<e> (the natural logarithm base) to the power of EXPR.
es_es: Devuelve I<e> (la base natural del logaritmo) a la potencia de EXPR.

source: In Perl 5.8.0 many Unicode features were introduced.
es_es: En Perl 5.8.0 se introdujeron muchas características Unicode.

source: (This 'integer' is _at_least_ 32 bits wide.
es_es: (Este 'entero' es _al_menos_, de 32 bit de ancho.

source: c A signed char (8-bit) value.
es_es: c Un valor de un carácter con signo (8 bit).

source: See L<perlgpl> and L<perlartistic>.
es_es: Vea L<perlgpl> y L<perlartistic>.

source: This is a change to the behaviour documented for 5.10.0.
es_es: Esto es un cambio en el comportamiento documentado para 5.10.0.

source: If the first delimiter is not an opening punctuation, three delimiters must be same such as C<s!!!> and C<tr)))>, in which case the second delimiter terminates the left part and starts the right part at once.
es_es: Si el primer delimitador no es un carácter de puntuación de apertura, los tres delimitadores deben ser el mismo, como C<s!!!> y C<tr)))>, en cuyo caso el segundo delimitador termina la parte izquierda y, a la vez, comienza la parte derecha.

source: $who = "Larry";
es_es: $quien = "Larry";

source: You don't get the UTF-8
es_es: No obtiene los bytes UTF-8

source: C<Safe> upgraded to version 2.12
es_es: C<Safe> actualizado a la versión 2.12

source: See L<perlvms>.
es_es: Vea L<perlvms>.

source: Don't turn on the compiler optimization flag "-O".
es_es: No active el indicador "-O" de optimización del compilador.

source: Try not to launch headlong into developing your module without spending some time thinking first.
es_es: Trate de no poner en marcha, de memoria, el desarrollo de su módulo, sin pasar en primer lugar algún tiempo pensándolo.

source: Although it retains most of the original content from its O'Reilly Network, it is now hosted by The Perl Foundation.
es_es: Aunque conserva la mayor parte del contenido original de O'Reilly Network, ahora se hospeda en The Perl Foundation.

source: Returns the next directory entry for a directory opened by C<opendir>.
es_es: Devuelve la siguiente entrada de directorio de un directorio abierto con C<opendir>.

source: \X [4] Match Unicode "eXtended grapheme cluster"
es_es: \X [4] Coincide con una "agrupación de grafemas eXtendida" Unicode

source: For more information about the portability of these functions, see L<perlport> and other available platform-specific documentation.
es_es: Para más información sobre la portabilidad de estas funciones, ver L<perlport> y cualquier otra documentación específica de la plataforma que esté disponible.

source: A Perl program consists of a sequence of declarations and statements which run from the top to the bottom.
es_es: Un programa Perl consiste en una secuencia de declaraciones e instrucciones que se ejecutan de arriba hacia abajo.

source: Don't do that either.
es_es: Tampoco haga esto.

source: Count=9
es_es: Contador=9

source: Count=2
es_es: Contador=2

source: =head1 Supported Platforms
es_es: =head1 Plataformas soportadas

source: # as a sort subroutine (including other package's subroutines)
es_es: # como una subrutina para sort (incluyendo subrutinas de otros paquetes)

source: Count=3
es_es: Contador=3

source: Operators borrowed from C keep the same precedence relationship with each other, even where C's precedence is slightly screwy.
es_es: Los operadores tomados del C mantienen la misma relación de precedencia entre sí, incluso donde la precedencia de C está ligeramente chiflada.

source: Count=1
es_es: Contador=1

source: See also C<< (?>pattern) >> and possessive quantifiers for other ways to control backtracking.
es_es: Vea también C<< (?>patrón) >> y los cuantificadores posesivos para ver otras formas de control de la vuelta atrás.

source: In scalar context, returns the caller's package name if there I<is> a caller (that is, if we're in a subroutine or C<eval> or C<require>) and the undefined value otherwise.
es_es: En contexto escalar, devuelve el nombre del paquete del llamante si aquel I<es> un llamante, es decir, si estamos en una subrutina, C<eval> o C<require>, y el valor indefinido en otro caso.

source: perlunicode Perl Unicode support
es_es: perlunicode Compatibilidad con Unicode

source: =head2 An Example: the NULL termination problem.
es_es: =head2 Ejemplo: el problema de la terminación de cadenas con un carácter NULL

source: exec {'/bin/csh'} '-sh'; # pretend it's a login shell
es_es: exec {'/bin/csh'} '-sh'; # finge que es un shell de login

source: See L<Named Unary Operators> for more discussion of this.
es_es: Ver L<Operadores unarios con nombre> para una discusión más sobre esto.

source: =head2 Hash Randomisation
es_es: =head2 Aleatorización Hash

source: See also L<perlipc> for more examples of forking and reaping moribund children.
es_es: Ver también L<perlipc> para más ejemplos de fork y borrado de hijos moribundos.

source: add DEL to [:cntrl:]
es_es: añadir DEL a [:cntrl:]

source: =item Keywords related to the switch feature
es_es: =item Palabras clave relativas a la característica switch

source: Well, if you want only one of the elements, it's trivial:
es_es: Bueno, si desea sólo uno de los elementos, es trivial:

source: Same as C<S{0,1}>, C<S{0,BIG_NUMBER}>, C<S{1,BIG_NUMBER}> respectively.
es_es: Lo mismo que C<S{0,1}>, C<S{0,BIG_NUMBER}>, C<S{1,BIG_NUMBER}>, respectivamente.

source: print($foo), exit; # Or this.
es_es: print($foo), exit; # O esto.

source: =head2 What are Perl 4, Perl 5, or Perl 6?
es_es: =head2 ¿Qué son Perl 4, Perl 5 y Perl 6?

source: Returns C<1> for success, C<0> otherwise.
es_es: Devuelve C<1> en caso de éxito; de otra manera, C<0>.

source: =item ord EXPR X<ord> X<encoding>
es_es: =item ord EXPR X<ord> X<encoding> X<codificación>

source: Perl5.004 builds out of the box on Unix, Plan 9, LynxOS, VMS, OS/2, QNX, AmigaOS, and Windows NT.
es_es: Perl5.004 se compila en Unix, Plan 9, LynxOS, VMS, OS / 2, QNX, AmigaOS y Windows NT.

source: You can always find the latest version of perl on a CPAN (Comprehensive Perl Archive Network) site near you at http://www.cpan.org/src/
es_es: Siempre puede encontrar la última versión de perl en un sitio CPAN (Comprehensive Perl Archive Network) cerca de usted en http://www.cpan.org/src/

source: $other = 1;
es_es: $otro = 1;

source: The earlier immediate handling easily could corrupt the internal state of Perl, resulting in mysterious crashes.
es_es: El manejo inmediato anterior podría dañar el estado interno de Perl, lo que resulta en caídas misteriosas.

source: In other words, C<*FH> must be used to create new symbol table entries; C<*foo{THING}> cannot.
es_es: En otras palabras, C<*FH> debe ser usado para crear nuevas entradas de en la tabla de símbolos; C<*foo{COSA}>, no.

source: It is much more efficient than C<s/.$//s> because it neither scans nor copies the string.
es_es: Es más eficiente que C<s/.$//s> porque ni escanea ni copia el string.

source: One can now specify installation directories for site and vendor man and HTML pages, and site and vendor scripts.
es_es: Ahora se pueden especificar directorios de instalación para las páginas man y HTML, y scripts para el propio equipo y para el instalador del sistema.

source: print "File contains: ", <HANDLE>;
es_es: print "El archivo contiene: ", <HANDLE>;

source: (The difference between these two constructs is that the second one uses a capturing group, thus shifting ordinals of backreferences in the rest of a regular expression.)
es_es: (La diferencia entre estas dos construcciones es que el segundo utiliza un grupo de captura, aumentando el número de contrareferencias en el resto de la expresión regular.)

source: The list assignment in scalar context will translate that into the number of elements (here, the number of times the pattern matched) and assign that to $count.
es_es: La lista de asignación en contexto escalar se traducirá en el número de elementos (en este caso, el número de veces que el patrón coincide) y los asigna a $cuenta.

source: is equivalent to the more verbose
es_es: es equivalente al más verboso

source: Which perhaps unexpectedly yields:
es_es: del que, inesperadamente, sale:

source: The multi-number v-strings like v65.66 and 65.66.67 still continue to be v-strings in Perl 5.8.
es_es: v-strings con múltiples números como C<v65.66> y C<65.66.67> siguen siendo v-strings en Perl 5.8.

source: For instance, it's better to have:
es_es: Por ejemplo, es mejor tener:

source: Does the opposite of a C<shift>.
es_es: El opuesto de un C<shift>.

source: A number of regressions on VMS have been fixed.
es_es: Una serie de regresiones en VMS han sido corregidas.

source: =item kill SIGNAL, LIST X<kill> X<signal>
es_es: =item kill SEÑAL, LISTA X<kill> X<signal> X<señal>

source: $n = 1234; # decimal integer
es_es: $n = 1234; # entero decimal

source: See L<perltoot> and L<perlobj> for more about the blessing (and blessings) of objects.
es_es: Ver L<perltoot> y L<perlobj> para saber más sobre bautizos (y bautizar) de objetos.

source: @args = ( "echo surprise" );
es_es: @args = ( "echo sorpresa" );

source: =head1 SUMMARY
es_es: =head1 RESUMEN

source: C<h2xs> implements a new option C<--use-xsloader> to force use of C<XSLoader> even in backwards compatible modules.
es_es: C<h2xs> implementa una nueva opción: C<--use-xsloader>, para forzar el uso de C<XSLoader> incluso en módulos retro-compatibles.

source: This modifier may be specified to be the default by C<use locale>, but see L</Which character set modifier is in effect?>.
es_es: Este modificador se puede especificar que sea el predeterminado por C<use locale>, pero vea L</¿Qué modificador de conjunto de caracteres está en vigor?>.

source: C<grep>, C<join>, C<map>, C<qw//>, C<reverse>, C<sort>, C<unpack>
es_es: C<grep>, C<join>, C<map>, C<qw/STRING/>, C<reverse>, C<sort>, C<unpack>

source: # ensure the leading "0" for any octal, prefix non-zero hexadecimal with "0x" or "0X", prefix non-zero binary with "0b" or "0B"
es_es: # garantiza el "0" inicial para todos los octales, prefija hexadecimales no ceros con "0x" o "0X", prefija binarios no cero con "0b" o "0B"

source: Slices in scalar context return the last item of the slice.
es_es: Las porciones, en contexto escalar, devuelven el último elemento de la porción.

source: If EXPR is an empty string, returns 0.
es_es: Si EXPR es una cadena vacía, devuelve 0.

source: Extensive work on the v-strings by John Peacock.
es_es: Una amplia labor en la v-strings por parte de John Peacock.

source: (This is merely an alternate way of specifying input to the program.) You may also sell a binary produced by the dumping of a running Perl script that belongs to you, provided that you provide or offer to provide the Perl source as specified by the GPL.
es_es: (Esto no es más que una forma alternativa de especificar una entrada al programa.) También puede vender un binario producido por el volcado de una ejecución de un script en Perl que le pertenezca a usted, a condición de que proporcione u ofrezca una forma de proporcionar el código fuente de Perl según lo especificado por la GPL.

source: perlqnx Perl notes for QNX
es_es: perlqnx Notas para QNX

source: If the pattern evaluates to the empty string, the last successfully executed regular expression is used instead.
es_es: Si el patrón se evalúa a la cadena vacía, se utiliza en su lugar la última expresión regular ejecutada con éxito.

source: By default, the top-of-page format is the name of the filehandle with "_TOP" appended.
es_es: De manera predeterminada, el formato de la parte superior de la página es el nombre del identificador de archivo con el sufijo "_TOP" añadido.

source: my @squares = map { $_ > 5 ? ($_ * $_) : () } @numbers;
es_es: my @cuadrados = map { $_ > 5 ? ($_ * $_) : () } @numeros;

source: When many separate operations will need to be applied to the same set of data
es_es: Cuando muchas operaciones diferentes deberán aplicarse al mismo conjunto de datos

source: If you want the pattern compiled only once the first time the variable is interpolated, use the C</o> option.
es_es: Si desea que el patrón sea compilado solo la primera vez que la variable sea interpola, utilice la opción C</o>.

source: =head2 Before you start
es_es: =head2 Antes de empezar

source: hash => { description => "key/value pairs", sigil => '%', },
es_es: hash => { descripcion => "pares clave/valor", sigilo => '%', },

source: Failed Test Stat Wstat Total Fail Failed List of Failed
es_es: Test erróneos Stat Wstat Total Error Errado Lista de errores

source: For instance, while utilities have "USAGE" sections, Perl modules usually have "SYNOPSIS" sections: C<podselect -s "SYNOPSIS" ...> will extract this section for a given file.
es_es: Por ejemplo, a diferencia de las utilidades que tienen secciones "USAGE", los módulos Perl generalmente tienen secciones "SYNOPSIS" (SINOPSIS): C<podselect -s "SYNOPSIS" ...> extrae la sección correspondiente de un archivo especificado.

source: They're visible only in their lexical scope, but their value is persistent: unlike C<my> variables, they're not undefined at scope entry, but retain their previous value.
es_es: Son visibles sólo en su ámbito léxico, pero su valor es persistente: a diferencia de las variables C<my>, que no están definidos a la entrada de su ámbito, sino que conservan su valor anterior.

source: They may appear to sleep longer than that, however, because your process might not be scheduled right away in a busy multitasking system.
es_es: Sin embargo, quizás puedan parecer dormir más de lo indicado, debido a que su proceso no puede ser planificado de forma inmediata en un sistema multitarea ocupado.

source: If a filter has been installed with this method, it will be invoked every time you write a value to a DBM database.
es_es: Si se ha instalado un filtro con este método, se invocará cada vez que se escriba un valor en una base de datos DBM.

source: C<threads> is now a dual-life module, also available on CPAN.
es_es: C<threads> es ahora un módulo con doble vida, también disponible en CPAN.

source: Match exactly n times, not greedily (redundant)
es_es: Coincide exactamente n veces, sin avaricia (redundante)

source: ($a_or_b ? $a : $b) = $c;
es_es: ($a_o_b ? $a : $b) = $c;

source: If you don't have write access to the DBM file, you can only read hash variables, not set them.
es_es: Si no tiene permiso de escritura al archivo DBM, sólo podrá leer las variables hash, pero no asignarlas.

source: Perl is not produced nor maintained by the Free Software Foundation.
es_es: La Free Software Foundation no tiene nada que ver con el desarrollo y el mantenimiento de Perl.

source: Individual modules in F<lib/>, F<ext/>, F<dist/>, and F<cpan/> usually have their own documentation, either in the F<Module.pm> file or an accompanying F<Module.pod> file.
es_es: En general, los módulos individuales de F<lib/>, F<ext/>, F<dist/> y F<cpan/> tienen su propia documentación, ya sea en el archivo F<Módulo.pm> o en un archivo F<Módulo.pod> adjunto.

source: See http://www.cpan.org/modules/00modlist.long.html or http://search.cpan.org/ for a more complete list of modules by category.
es_es: En http://www.cpan.org/modules/00modlist.long.html y http://search.cpan.org/ encontrará una lista más completa de módulos clasificados por categorías.

source: The length of OPSTRING implies the number of semaphore operations.
es_es: La longitud de OPSTRING implica el número de operaciones de semáforos.

source: In some literature this construct is called "atomic matching" or "possessive matching".
es_es: En alguna literatura esta construcción es llamada "coincidencia atómica" o "concordancia posesiva".

source: . a single character
es_es: . un solo carácter

source: This entered computer lingo via the paper "On Holy Wars and a Plea for Peace" by Danny Cohen, USC/ISI IEN 137, April 1, 1980.
es_es: Esto entró en la jerga informática a través del documento "On Holy Wars and a Plea for Peace" (De las Guerras Santas y un llamamiento por la Paz), de Danny Cohen, USC/ISI IEN 137, 1 de abril de 1980.

source: =head2 Alphabetical Listing of Perl Functions
es_es: =head2 Lista de funciones de Perl en orden alfabético

source: introduce the -t option for gentler taint checking
es_es: introducir la opción -t para un control de seguridad aceitoso más suave
